ojc-core/workflowse/sample/purchaseOrderReview/PurchaseOrderCompositeApp/test/sendCheapPurchaseOrderTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:po="http://wlmse.sample/po">
  <soapenv:Body>
    <po:purchaseOrder>
      <po:orderId>1111</po:orderId>
      <po:purchaserName>Joe</po:purchaserName>
      <po:productId>golf club</po:productId>
      <po:amount>100.00</po:amount>
      <po:users>CustomerServiceRep</po:users>
      <po:priority>Low</po:priority>
    </po:purchaseOrder>
  </soapenv:Body>
</soapenv:Envelope>